/** @type {import('../lib/types').quizset} */
const quiz_1 = {
	index: 0,
	virus_name: 'lassa virus',
	questions: [
		{
			hint: 'ไวรัสชนิดนี้เป็นสาเหตุของโรคไข้เลือดออกที่มีหนูเป็นพาหะ ( lassavirus )'
		},
		{
			hint: 'ไวรัสชนิดนี้มีสายพันธุ์ที่ชื่อว่า arenavirus'
		},
		{
			hint: 'ใช้ยาที่มีชื่อว่า ribavirin ในการต่อต้านไวรัสชนิดนี้'
		},
		{
			hint: 'เมื่อติดเชื้อไวรัสชนิดนี้จะมีอาการเจ็บคอ ปวดหัว ไอ อาเจียน ตาอักเสบ คออักเสบเป็นหนอง ที่ร้ายที่สุดอาจทำให้หูหนวกได้'
		},
		{
			hint: 'ไวรัสชนิดนี้สามารถติดได้หากได้รับละอองฝอย หรือสัมผัสอุจจาระของหนูมีแวคซีน หลายชนิด'
		},
		{
			hint: 'trolled'
		}
	]
};

/** @type {import('../lib/types').quizset} */
const quiz_2 = {
	index: 1,
	virus_name: 'marburg virus',
	questions: [
		{
			hint: 'ไวรัสชนิดนี้ถูกตรวจพบครั้งแรกในผู้ป่วยที่ติดเชื้อจากการชำแหละลิงชิมแปนซี'
		},
		{
			hint: 'เมื่อได้รับเชื้อไวรัสชนิดนี้จะมีอาการไข้สูง อ่อนเพลีย ปวดกล้ามเนื้อ ปวดหัว เจ็บคอ ท้องเสีย มีผื่นนูนแดงตามลำตัว้'
		},
		{
			hint: 'หากไม่อยากติดเชื้อไวรัสชนิดนี้ไม่ควรมีเพศสัมพันธ์กับผู้ที่ป่วยหลังจากการเจ็บป่วยเป็นเวลา 3 เดือน'
		},
		{
			hint: 'ไวรัสชนิดนี้ใช้เวลาฝักตัว 2-21 วัน'
		},
		{
			hint: 'ไวรัสชนิดนี้มีรูปร่างแบบ pleomorphic ไม่แน่นอน'
		},
		{
			hint: 'trolled'
		}
	]
};

/** @type {import('../lib/types').quizset} */
const quiz_3 = {
	index: 2,
	virus_name: 'polio virus',
	questions: [
		{
			hint: 'ไวรัสชนิดนี้แพ่เชื้อจากคนสู่คนเท่านั้น'
		},
		{
			hint: 'ไวรัสชนิดนี้อยู่ในลำไส้ของมนุษย์เท่านั้น'
		},
		{
			hint: 'เด็กทุกคนควรได้รับวัคซีนป้องกันไวรัสชนิดนี้ 5 ครั้งเมื่ออายุ 2, 4, 6 และ 18 เดือน และกระตุ้นอีกครั้งเมื่ออายุ 4 ปี'
		},
		{
			hint: 'ถ้าไม่อยากติดไวรัสชนิดนี้ควรล้างมือทุกครั้งล้างจากเข้าห้องน้ำ'
		},
		{
			hint: 'หากผู้ใดที่ได้รับไวรัสชิดนี้จะมีอาการไข้ต่ำๆ เจ็บคอ เวียนหัว อาเจียน ปวดท้อง บางครั้งอาจทำให้เป็นอัมพาต'
		},
		{
			hint: 'trolled'
		}
	]
};

/** @type {import('../lib/types').quizset} */
const quiz_4 = {
	index: 3,
	virus_name: 'hendra virus',
	questions: [
		{
			hint: 'ไวรัสชนิดนี้มีสายพันธุ์เดียวกับไวรัสนิปาห์'
		},
		{
			hint: 'ไวรัสชนิดนี้ก่อให้เกิดโรคติดเชื้อในระบบทางเดินหายใจ'
		},
		{
			hint: 'ไวรัสชนิดนี้อยู่ในสกุล Henipaviruses วงศ์ Paramyxoviridae'
		},
		{
			hint: 'ไวรัสชนิดนี้มีพาหะมาจากม้าและหมู'
		},
		{
			hint: 'หากติดไวรัสชนิดนี้จะมีอาการโคม่า หายใจล้มเหลว มีไข้สูง ปวดหัว เจ็บคอ วิงเวียน ซึม คล้ายไข้หวัด ถึงขั้นเสียชีวิตได้'
		},
		{
			hint: 'trolled'
		}
	]
};

/** @type {import('../lib/types').quizset} */
const quiz_5 = {
	index: 4,
	virus_name: 'yellow fever virus',
	questions: [
		{
			hint: 'ไวรัสชนิดนี้มียุงเป็นพาหะที่นำเชื้อจากผู้ป่วยที่เป็นโรคที่เกิดจากไวรัสชนิดนี้ไปสู่คนปกติ'
		},
		{
			hint: 'โรคที่เกิดจากไวรัสชนิดนี้เป็นโรคประจำถิ่นที่พบได้มากในทวีปแอฟริกาและอเมริกาใต้'
		},
		{
			hint: 'ผู้ที่ติดไวรัสชนิดนี้จะมีอาการเป็นไข้ร่วมกับตัวเหลือง'
		},
		{
			hint: 'ไวรัสชนิดนี้อยู่ในตระกูล flavivirus'
		},
		{
			hint: 'เมื่อได้รับเชื้อไวรัสชนิดนี้จะมีอาการ ไข้สูง ปวดศีรษะ ปวดกล้ามเนื้อ หนาวสั่น เบื่ออาหาร คลื่นไส้ อาเจียน ตัวเหลือง'
		},
		{
			hint: 'trolled'
		}
	]
};

/** @type {import('../lib/types').quizset_list} */
const quiz_list = [quiz_1, quiz_2, quiz_3, quiz_4, quiz_5];

export { quiz_1 };
export default quiz_list;
